{"meta":{"title":"OrchidViolet","subtitle":"OrchidViolet's blog","description":"","author":"OrchidViolet","url":"http://OrchidViolet.github.io","root":"/"},"pages":[{"title":"search","date":"2022-03-07T09:29:50.000Z","updated":"2022-03-07T09:29:50.594Z","comments":true,"path":"search/index.html","permalink":"http://orchidviolet.github.io/search/index.html","excerpt":"","text":""},{"title":"categories","date":"2022-03-10T03:13:04.000Z","updated":"2022-03-10T03:13:17.322Z","comments":true,"path":"categories/index.html","permalink":"http://orchidviolet.github.io/categories/index.html","excerpt":"","text":""},{"title":"404","date":"2022-03-07T09:30:14.000Z","updated":"2022-03-07T09:30:14.027Z","comments":true,"path":"404/index.html","permalink":"http://orchidviolet.github.io/404/index.html","excerpt":"","text":""},{"title":"tags","date":"2022-03-10T03:11:28.000Z","updated":"2022-03-10T03:11:56.143Z","comments":true,"path":"tags/index.html","permalink":"http://orchidviolet.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"cloud computing -- hw1","slug":"hw1","date":"2022-03-18T07:40:20.000Z","updated":"2022-03-18T09:21:03.857Z","comments":true,"path":"2022/03/18/hw1/","link":"","permalink":"http://orchidviolet.github.io/2022/03/18/hw1/","excerpt":"","text":"What are the technical components of the operational capability technology? Broadband network and Internet architecture: Internet is based on a centerless supply and management model and is not controlled by any centralized entity.The main components are connectionless packet switching and router-based interconnection using network routers and interactive machines. Data center technology: the data center is a special IT infrastructure for centralized storage of IT resources, which should be operable remotely and have high availability. Virtualization technology: server virtualization refers to the use of virtualization software to abstract IT hardware into virtual servers, which is hardware-independent and has multiple levels of virtualization technology. Web technology: the common term for the implementation of cloud services, the basic technologies include URL, HTTP, HTML and XML, with great flexibility. Multi-tenant technology: similar to virtualizing software, each tenant is unaware of the existence of other tenants, which can improve security and facilitate billing. Service technology: it is composed of Web services, service agents and service middleware, which standardizes and simplifies the deployment of cloud services. List at least three virtualization softwar. Docker: container virtualization, virtualizing a separate environment on the host computer for software use, rather than virtualizing a new system, is more convenient to use, but the simulation is not as real as the virtual machine. The bare metal virtualization system provided by VMware ESXi:VMware does not need a host system and can run multiple virtual machines directly. The personal virtualization software provided by VMware Workstation:VMware needs to run the software on the host operating system and then run the virtual machine on the software.","categories":[],"tags":[{"name":"cc-hw","slug":"cc-hw","permalink":"http://orchidviolet.github.io/tags/cc-hw/"}]},{"title":"test","slug":"test1","date":"2022-03-15T03:17:10.000Z","updated":"2022-03-18T09:06:50.059Z","comments":true,"path":"2022/03/15/test1/","link":"","permalink":"http://orchidviolet.github.io/2022/03/15/test1/","excerpt":"","text":"This is a test.","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2022-03-07T07:39:01.957Z","updated":"2022-03-16T07:01:23.550Z","comments":true,"path":"2022/03/07/hello-world/","link":"","permalink":"http://orchidviolet.github.io/2022/03/07/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[{"name":"cc-hw","slug":"cc-hw","permalink":"http://orchidviolet.github.io/tags/cc-hw/"}]}